[
  {
    "id": "applicant-11",
    "matriculationYear": "2028",
    "stateOfResidency": "PA",
    "gender": "Male",
    "race": "White",
    "major": "General Biology, Environmental Science and Tech",
    "gpa": 3.62,
    "mcat": 520,
    "mcatBreakdown": null,
    "medicalVolunteering": "COVID19 Vaccine Distribution - 60 hours, ED Patient Visitor Volunteer - 500 hours",
    "nonMedicalVolunteering": "HIV/AIDS Housing Non-Profit - 60 hours, Mutual Aid (Underresouced Students) Tutor - 200 hours",
    "leadership": "University Student Judiciary, Training Chair - 700 hours - MME",
    "nonMedicalEmployment": "N/A",
    "medicalEmployment": "ED Scribe (thru ScribeAmerica) - 465 hours - MME",
    "shadowing": "Different doctors (too many to list in different departments in different states) - 125 hours from 2019-2022",
    "awardsHonors": "Awards: Pavela Prize (Award from USJ), Delta Alpha PI Honor Society",
    "research": "Vascular Medicine Institute at UPMC (Wet-Lab) - 200hours completed and 2000 anticipated hours, ALMIAC at NIH (Off-site microscopy lab during COVID) - 400 hours during one summer, Community Engagement, Environmental Science and Health Center (Public Health Research) - 1000 hours, USACEHR at Walter Reed (Wet-Lab) - 400 hours",
    "hobbies": "Swimming",
    "otherActivities": "Nope",
    "reflections": "Find a niche. Every essay that you write should be a story/anecdote, but even more broad than that, your entire application should be a story about who you are. I really emphasized my Environmental Science background since I thought it would be unique, and, as such, really emphasized my commitment to SDoH research and working with underserved communities. As such, I ended up interviewing at schools that would have been otherwise out of my league based on my GPA. Every med school, including the top med schools want students who have their unique passions since they want a diverse student body and students who can contribute to their institution. If you're just checking off a checklist (GPA, MCAT, Research, Volunteering, etc.) you're going to be disappointed in your cycle. Find something that you're truly passionate about and work that into your reasoning for going to med school!",
    "acceptedSchools": ["TouroCOM", "PCOM", "University of Michigan", "University of Pittsburgh"],
    "gapYears": null
  },
  {
    "id": "applicant-12",
    "matriculationYear": "2021",
    "stateOfResidency": "Pennsylvania",
    "gender": "Male",
    "race": "White",
    "major": "Biology major, economic policy minor",
    "gpa": 3.99,
    "mcat": 518,
    "mcatBreakdown": null,
    "medicalVolunteering": "Hospital volunteer - 200 hours",
    "nonMedicalVolunteering": "Youth education volunteer - 200 hours",
    "leadership": "Penn Hellenic club - president, Board member of Engineers of Medicine",
    "nonMedicalEmployment": "Tutor - 50 hours, TA - 100 hours",
    "medicalEmployment": "None",
    "shadowing": "Cardiology shadowing - 100 hours",
    "awardsHonors": "Deans list, summa cum laude, phi beta kappa",
    "research": "Student researcher in radiation oncology - 3000 hours, SUMMER UNDERGRADUATE RESEARCH PROGRAM IN RADIATION SCIENCE fellow - 800 hours",
    "hobbies": "Sports",
    "otherActivities": "None",
    "reflections": "It's all about your mcat, gpa, and recommendation letters",
    "acceptedSchools": ["Feinberg School of Medicine"],
    "gapYears": 0
  },
  {
    "id": "applicant-13",
    "matriculationYear": "2023",
    "stateOfResidency": "VA",
    "gender": null,
    "race": null,
    "major": "BA Neuroscience",
    "gpa": 3.95,
    "mcat": 516,
    "mcatBreakdown": null,
    "medicalVolunteering": "Volunteer in cardiac care unit - 50",
    "nonMedicalVolunteering": "Red Cross blood blank - 50, Food bank - 100",
    "leadership": "Treasurer - Association for Indias Development (student org), President - Neuroscience Honor Society (student org)",
    "nonMedicalEmployment": null,
    "medicalEmployment": "Scribe - 200 hrs",
    "shadowing": "Shadowed neurosurgery",
    "awardsHonors": "Poster presentation, research scholarship",
    "research": "Research assistant - 2000 hrs",
    "hobbies": null,
    "otherActivities": null,
    "reflections": "Writing is key. I wish I spent more time carefully pre-writing secondaries.",
    "acceptedSchools": ["Pittsburgh"],
    "gapYears": 1
  },
  {
    "id": "applicant-14",
    "matriculationYear": "2021",
    "stateOfResidency": "Florida",
    "gender": "Ciswoman",
    "race": "Chinese-Jamaican",
    "major": "Major in Geography, minor in Mandarin",
    "gpa": 4.0,
    "mcat": 512,
    "mcatBreakdown": null,
    "medicalVolunteering": "n/a",
    "nonMedicalVolunteering": "N/a",
    "leadership": "N/a",
    "nonMedicalEmployment": "Worked at an after school program part time",
    "medicalEmployment": "n/a",
    "shadowing": "n/a",
    "awardsHonors": "dunkle award",
    "research": "2 projects 40hours",
    "hobbies": "dance",
    "otherActivities": null,
    "reflections": "Major in something you enjoy and focus on pre-req classes.",
    "acceptedSchools": ["University of Virgnia"],
    "gapYears": 0
  },
  {
    "id": "applicant-15",
    "matriculationYear": "2023",
    "stateOfResidency": "PA",
    "gender": "Female",
    "race": "White",
    "major": "Psychology, Spanish Majors, Chemistry and Biology Minors",
    "gpa": 4.0,
    "mcat": 516,
    "mcatBreakdown": null,
    "medicalVolunteering": "Volunteering at Rainbow - 50, Nursing Clinical Rotations - 50",
    "nonMedicalVolunteering": "TeachAids Global Health Fellow- 400, High School Running Coach - 50",
    "leadership": "Tour Guide Executive Council - 500, Yoga Club - 100",
    "nonMedicalEmployment": "Tour Guiding - 200, Peer Tutor - 200, Yoga Instructor - 100",
    "medicalEmployment": "Clinical Technician at the Cleveland Clinic / St. Francis Hosptial - 1500",
    "shadowing": "Rainbow Nicu - 20",
    "awardsHonors": "Deans high Honors, Phi Beta Kappa Prize, Spanish Prize for excellence in Spanish, Outstanding Junior Award for the College of Arts and Sciences",
    "research": "NICU Research with Dr. Ryan, Wet Lab work with Dr. McFarland",
    "hobbies": "Running",
    "otherActivities": null,
    "reflections": "Having fewer, very significant experiences is better than broad ones that cover alot of topics but you cant expand upon.",
    "acceptedSchools": ["University of Pittsburgh", "University of Rochester", "University of North Carolina"],
    "gapYears": 0
  },
  {
    "id": "applicant-16",
    "matriculationYear": "2023",
    "stateOfResidency": "Ohio",
    "gender": "Male",
    "race": "Asian",
    "major": "Biomedical Engineering",
    "gpa": 3.93,
    "mcat": 510,
    "mcatBreakdown": null,
    "medicalVolunteering": "CWRU EMS ~500; Judson Nursing Home Volunteer ~100",
    "nonMedicalVolunteering": "Tutoring ~50",
    "leadership": "TASA exec board ~50 hrs",
    "nonMedicalEmployment": "BME TA ~200 hrs",
    "medicalEmployment": "Lifeguarding ~1000+",
    "shadowing": "~50 hrs",
    "awardsHonors": "1 poster presentation in soft tissue sarcoma",
    "research": "Biomedical Imaging + Biomedical Mechanics (solidworks) research",
    "hobbies": "Swimming; Lifting; DJing; Crew",
    "otherActivities": null,
    "reflections": "I think the thing I learned the most was to be a bit more picky with research and extracurricular. There were so many times during undergrad when I felt that a lot of the work I was doing, I did not enjoy at all. I would procrastinate and sometimes do a shoddy job on projects. However, once I found something I enjoyed (in my case EMS), work didn't feel like work and learning wasn't tedious. I was able to sink many hours into bettering my skills and improving the organization. I was also able to take away more from the experience, which generated valuable/memorable stories that I was able to tell during my interviews/application. Of course, there are times that we must do busy work just to fill up an application for med school. But, at the end of the day, definitely try to find activities that interest YOU. They are your best asset.",
    "acceptedSchools": ["Wake Forest University School of Medicine"],
    "gapYears": 0
  },
  {
    "id": "applicant-17",
    "matriculationYear": "2027",
    "stateOfResidency": "ny",
    "gender": "female",
    "race": "white",
    "major": "majors: german; molecular and cellular biology, no minors",
    "gpa": 3.7,
    "mcat": 521,
    "mcatBreakdown": null,
    "medicalVolunteering": "covid vaccine site administrator; 20 hours",
    "nonMedicalVolunteering": "prison tutoring in baltimore; 200 hrs, on the board of a non profit in nyc; 100 hrs",
    "leadership": "german club exec board, varsity soccer captain",
    "nonMedicalEmployment": "soccer coaching 100, tutoring 200, student athlete advising 200",
    "medicalEmployment": "paid covid-19 contact tracer; 100 hours, paid research work; 200 hours",
    "shadowing": "orthopedic surgery 10 hours",
    "awardsHonors": "research grant; student athlete award; several abstracts and publications post-UG",
    "research": "basic research, clinical resaerch 2 gap years full time 1000 hours",
    "hobbies": "varsity college soccer; varsity college track; photography; piano classical; hiking skiing teaching music poetry traveling spanish",
    "otherActivities": null,
    "reflections": "what your activities are doesnt matter. in all of your engagements be sure to show that you go above and beyond. that you think a step ahead, start a new program, improve the structure that youre working in. also be sure to have mentors that inspire you and talk about why. also REALLY embrace your individuality in any way you can - show that you have hobbies and sustained interests. also gap years are great and truly help you during medical school rotations.",
    "acceptedSchools": ["Columbia", "Cornell", "UMass", "Boston U", "USC", "SUNY downstate", "NYMC"],
    "gapYears": 2
  },
  {
    "id": "applicant-18",
    "matriculationYear": "2025",
    "stateOfResidency": "OH",
    "gender": "Male",
    "race": "Asian",
    "major": "BME and CS majors, Chemistry minor",
    "gpa": 4.0,
    "mcat": 527,
    "mcatBreakdown": null,
    "medicalVolunteering": "Crisis text line (~250-300 hrs)",
    "nonMedicalVolunteering": "None",
    "leadership": "BMES secretary (~100 hours), Peer Advising (~560 hrs)",
    "nonMedicalEmployment": "TA positions (3 of them, ~ 600 hours total), Peer Advisor (~560 hrs)",
    "medicalEmployment": "Medical scribe (~400 hrs)",
    "shadowing": "Neurology clinics (various subspecialties, 90 hrs), Radiology, diagnostic and interventional (10 hours)",
    "awardsHonors": "Tau Beta Pi (engineering honor society) Scholarship ($2000), Scholar at a NIH-funded summer research program ($5000), Received highest award for academic/extracurricular/research achievement in my major, among other awards from my university for academic achievement. ~7 conference presentations on medical image AI, including 4 oral presentations and 2 proceedings papers. Personally delivered 2 oral presentations at a NIH and international society conference, and won best poster at the poster symposium at my undergraduate institution. Received several grants to fund travel to attend.",
    "research": "Medical Imaging artificial intelligence research (~2500 hours)",
    "hobbies": null,
    "otherActivities": null,
    "reflections": "Probably wouldn't have applied MD/PhD and MD at the same time. Made things pretty difficult (more essays, the interviews are hella long) and probably cut my chances in both programs. I think that gap year for MD/PhD is practically compulsory now — otherwise research output generally won't be good enough to get in. I probably would have started stuff earlier. Only really started working on my activities like … sophomore year at the earliest? Made things pretty rough. Volunteering specifically was definitely a weak point for me and my application. I just never found anything more hands-on that I could do logistically and really felt passionate about. However, I guess I didn't try that hard. Definitely should have prepared for interviews more lol, I barely practiced and some of them went just OK. I only applied to 15 schools, but I think I'm happy with that. My biggest thing was finding a good school with a good/chill culture that's cheap, so that's the only schools I applied to.",
    "acceptedSchools": ["UVA", "Ohio State"],
    "gapYears": 0
  },
  {
    "id": "applicant-19",
    "matriculationYear": "2025",
    "stateOfResidency": "Virginia",
    "gender": "Female",
    "race": "White",
    "major": "Majors: Chemical Biology (BA), Chemistry (BA), Minors: Biology, Psychology",
    "gpa": 3.94,
    "mcat": 515,
    "mcatBreakdown": null,
    "medicalVolunteering": "Transplant House of Cleveland (~100)",
    "nonMedicalVolunteering": "Habitat for Humanity (~150)",
    "leadership": "Peer tutoring (~50), Peer Coaching (~15), oSTEM Executive board, Habitat for Humanity Executive Board, Undergraduate Research Society Executive Board",
    "nonMedicalEmployment": "Peer Tutoring (50), Peer Coaching (15)",
    "medicalEmployment": "Nursing Assistant (600)",
    "shadowing": "Orthopedic Surgery (50 hours), Emergency Medicine (35), Family Medicine (20)",
    "awardsHonors": "N/A",
    "research": "Undergraduate research assistant at CWRU SOM (genetics dept), ~1400 hours",
    "hobbies": "N/A",
    "otherActivities": "N/A",
    "reflections": "It truly is a very hollistic process, and stats and hours aren't everything.",
    "acceptedSchools": ["New York Medical College"],
    "gapYears": 0
  },
  {
    "id": "applicant-20",
    "matriculationYear": "2024",
    "stateOfResidency": "NC",
    "gender": "Male",
    "race": "African American",
    "major": "Major in biology",
    "gpa": 3.9,
    "mcat": 515,
    "mcatBreakdown": null,
    "medicalVolunteering": "None on application",
    "nonMedicalVolunteering": "Boy Scouts volunteer (10 hours), Crisis textline (54 hours), American Red Cross blood drive (20 hours), Pediatric cancer patient non profit (13 hours), Book donation non profit (230 hours)",
    "leadership": "Organic chem TA (100 Hours)",
    "nonMedicalEmployment": "None on application",
    "medicalEmployment": "Certified Nurse Aide (200 hours)",
    "shadowing": "Family Medicine (15 hours)",
    "awardsHonors": "Chancellors list all semesters",
    "research": "Undergraduate Research Assistant (500 hours), Summer REU research experience at UNCC(390 hours)",
    "hobbies": "Both of these listed on app: pick up basketball, Meditation, spikeball club",
    "otherActivities": "Something else I included was a cancer research workshop I went to with my lab (20 hours)",
    "reflections": "Mcat is the only standardized metric on the entire app and is therefore likely the most important thing. I was a business major for my first year of college with no intention of being premed until summer before sophomore year. I assume that was taken into context when admissions people looked at my app. In all honesty I think I was able to get away with an ok application due to being a URM with good stats. At the end of the day I have no clue why I had a good cycle but I think the stats as a urm combined with generally \"checking the boxes\" is what did it for me. Whole process is a crapshoot.",
    "acceptedSchools": ["Mayo Clinic Alix School of Medicine (AZ/Fl)", "Northwestern Feinberg", "Wake Forest"],
    "gapYears": 0
  },
  {
    "id": "applicant-21",
    "matriculationYear": "2025",
    "stateOfResidency": "Wisconsin",
    "gender": "Female",
    "race": "Mixed (Asian and white)",
    "major": "Psychology and environmental studies double major, chemistry minor",
    "gpa": 3.975,
    "mcat": 510,
    "mcatBreakdown": null,
    "medicalVolunteering": "Seidman cancer center patient care volunteer, 200 hr",
    "nonMedicalVolunteering": "Food service volunteer (boxing food handout packages, Salvation Army, food pantry) 25 hr, garden volunteering with Foodstrong 100 hr",
    "leadership": "Organic chemistry TA 50 hr",
    "nonMedicalEmployment": "Environmental education intern at Wehr nature center 500 hr",
    "medicalEmployment": "Rogers behavioral hospital mental health technician 600 hr",
    "shadowing": "Shadowed clinical psychology, psychiatry, nephrology, family DO, infectious disease 100 hr",
    "awardsHonors": "Deans high honors x7 semesters, poster presented at MCW conference on nature therapy with clinical psychologist, Joseph Skigin Memorial award at case western (most outstanding premed), volunteering honors from University hospitals, volunteer of the month February 2025 university hospitals",
    "research": "Sex education research with Wellesley college and Cleveland planned parenthood 100 hr",
    "hobbies": "Varsity track and field 3000 hr, cooking, singing (voice through CIM 4 years), case concert choir 1 year",
    "otherActivities": null,
    "reflections": "I found that more important than being the \"perfect premed\" is finding things that you love and pursuing them. I grew up never wanting to be a doctor since I saw that as my \"parents profession\" and I wanted to forge my own path. I explored many different career paths including environmental sciences and psychology. Even as I discovered a passion for medicine and how I fit into that world, I never let go of the other things I loved. I kept pursuing environmental studies and psychology and looked to see how those passions might fit into my future as a physician. People will see that you love the things that you do and more importantly, you'll be happier doing what you do. I've found that by staying \"me\" throughout this path, I've actually been more successful than if I'd checked boxes or tried to mold myself into what we assume being a premed is. So love your research, love your volunteering, and if you don't, skip it and do something you actually love.",
    "acceptedSchools": ["AT Stills", "DMUCOM", "CCOM", "UWSMPH", "MCW", "SLU"],
    "gapYears": 0
  },
  {
    "id": "applicant-22",
    "matriculationYear": "2025",
    "stateOfResidency": "TX",
    "gender": null,
    "race": null,
    "major": "Biomedical Engineering",
    "gpa": 3.91,
    "mcat": 518,
    "mcatBreakdown": null,
    "medicalVolunteering": "Radiation Oncology Volunteer - 100 hrs, Clinical Trials Volunteer - 50 hrs",
    "nonMedicalVolunteering": "Tutoring - 75 hrs",
    "leadership": "TA - 750 hrs",
    "nonMedicalEmployment": "N/A",
    "medicalEmployment": "N/A",
    "shadowing": "Pediatrics - 30 hrs, Radiation Oncology - 50 hrs",
    "awardsHonors": null,
    "research": "Biomedical Imaging - 700 hrs, Bioinformatics - 1700 hrs",
    "hobbies": null,
    "otherActivities": null,
    "reflections": "Definitely having a purpose before starting pre-med, more than just liking science and helping people, and to build your application around that purpose",
    "acceptedSchools": ["UT Southwestern"],
    "gapYears": 1
  },
  {
    "id": "applicant-23",
    "matriculationYear": "2025",
    "stateOfResidency": "NJ",
    "gender": "Male",
    "race": null,
    "major": "Psychobiology",
    "gpa": 3.95,
    "mcat": 523,
    "mcatBreakdown": null,
    "medicalVolunteering": "Care Extenders (generic hospital volunteering)- 250, No One Dies Alone (with hospice patients)- 50, Psychiatry department volunteering- 60",
    "nonMedicalVolunteering": "Cal Teach- 60, Undergraduate Assistant- 370, Bruins Against Fentanyl OD- 180",
    "leadership": "Student leader in an undergraduate clinical research program- 515, Full-time manager of an undergraduate clinical research program- 3000",
    "nonMedicalEmployment": "None listed on AMCAS",
    "medicalEmployment": "Department of EM work study- 1400, Clinical research coordinator - 3000 (same activity as the one listed above re: managing undergraduate volunteers), Database manager for clinical trial - 450",
    "shadowing": "Pediatrician shadowing- 120, Miscellaneous shadowing as a clinical research volunteer- not listed as separate AMCAS activity but mentioned offhand in my application",
    "awardsHonors": "Twice published, presented at two conferences (one regional one national)",
    "research": "Undergraduate clinical research volunteer- 390, Department of EM work study- 1400, CRC- 3000, Database manager for clinical trial - 450",
    "hobbies": "Ultimate frisbee",
    "otherActivities": "Lived with all French roommates for a year, only spoke French at home",
    "reflections": "There are the haves and have nots, and I want to cater my services to those who are typically unable to obtain affordable healthcare. Good leadership should be based on being kind and understanding, however it also requires you to put your foot down when serious errors or lapses in judgement are made. Truly love what you do. It makes the days easier and genuine passion is easy to convey. Sometimes just being physically present for somebody is as powerful as anything you can say or do. Losing your dad to cancer and your friends to fentanyl ODs sucks",
    "acceptedSchools": ["Columbia", "New York Medical College"],
    "gapYears": 3
  },
  {
    "id": "applicant-24",
    "matriculationYear": "2022",
    "stateOfResidency": "MI",
    "gender": "F",
    "race": "Asian",
    "major": "Community and Global Public Health",
    "gpa": 4.0,
    "mcat": 519,
    "mcatBreakdown": null,
    "medicalVolunteering": "Gifts of art volunteer maybe 100?",
    "nonMedicalVolunteering": "Curis public health advocacy 50? Sunday school volunteer 50?",
    "leadership": "CURIS President- 50 hours, student ambassador of undergrad admissions- 50 hours",
    "nonMedicalEmployment": "None",
    "medicalEmployment": "Patient attendant (sitter)- 100 hours",
    "shadowing": "Not much maybe 25? Shadowed some cardiologists",
    "awardsHonors": "Graduated top 5%",
    "research": "GI recruitment- 50 hours. Project Healthy Schools- 50 hours",
    "hobbies": null,
    "otherActivities": null,
    "reflections": "Honestly being good at CARS helps so much because if I had a higher MCAT score some places would have automatically interviewed me. I also wish I had more significant research experience as many of the top schools are research heavy.",
    "acceptedSchools": ["Case Western"],
    "gapYears": 1
  },
  {
    "id": "applicant-25",
    "matriculationYear": "2022",
    "stateOfResidency": "Ohio",
    "gender": "Female",
    "race": "White",
    "major": "Biology",
    "gpa": 4.0,
    "mcat": 526,
    "mcatBreakdown": null,
    "medicalVolunteering": "Hospital (50 hours.)",
    "nonMedicalVolunteering": "Red Cross (500 hours.)",
    "leadership": "Student Government (100 hours.)",
    "nonMedicalEmployment": "Random Summer Jobs (1200 hours.)",
    "medicalEmployment": "Scribing (2000 hours.)",
    "shadowing": "None- COVID years.",
    "awardsHonors": null,
    "research": "Undergrad thesis, clinical research assistant (1200 hours.)",
    "hobbies": null,
    "otherActivities": null,
    "reflections": "I am from the US but did my undergrad in the UK at Cambridge. Significantly limited which schools I could apply too and had to retake some prereqs to have them on a US transcript. Was a real pain but ended up ok.",
    "acceptedSchools": ["Case", "Pitt"],
    "gapYears": 3
  },
  {
    "id": "applicant-26",
    "matriculationYear": "2022",
    "stateOfResidency": "New York",
    "gender": "Male",
    "race": "White",
    "major": "BA in Neuroscience, BS in Economics/Healthcare Management and Policy",
    "gpa": 3.71,
    "mcat": 521,
    "mcatBreakdown": null,
    "medicalVolunteering": "VA Volunteering (05/2016-05/2019) - 150 hours, Other hospital volunteering (09/2015-06/2016) - 110 hours, Other hospital volunteering (10/2019-03/2020) - 60 hours",
    "nonMedicalVolunteering": "School for Children with Cerebral Palsy - 50 hours",
    "leadership": "Varsity Sprint Football (Academic Captain) - 1325 hours, Tour Guiding Group (President Emeritus, President, Hosting Lead, Guide, etc.) - 800 hours, Medical Society Leadership and Committee Membership - 100 hours, Business/Neuroscience student group founder - 100 hours",
    "nonMedicalEmployment": "Gap Year: Presidential Management Fellow (12/2020-08/2022) - 4300 hours (full-time job), Tutoring/Content Creation for Tutoring (08/2019 - 08/2022) - 650 hours (part-time) In School: Resident Advisor (8/2017-5/2019): 900 hours",
    "medicalEmployment": "N/A",
    "shadowing": "50 hours? I didn't see it on my AMCAS primary when I revisited it, so I might not have actually put it down other than referencing it as a part of activity descriptions for related efforts (e.g. mentioned shadowing during a research summer internship)",
    "awardsHonors": "8 peer-reviewed pubs, 3 first author. Public Health Pitch Competition (2017) : Selected for the undergraduate Judge's Award. Friars Senior Society (2018): Selected for Penn's renowned leadership society. Bowl Award (2019): Voted by classmates to receive the second highest honor for a male in the senior class. CWIC Emerging Scholar Award (2019): Given to 2 students for publicly presenting their thesis research. LSM Benz Prize (2019): Given for extraordinary academic achievement and entrepreneurship. Dean's Award for Excellence (2019): Given to 2 Wharton seniors. Emily Murray Scholarship (2019): Selected for a 1-week immersion at the Hastings Center. OFSL Pillar of the Community Award (2019): Given to 2 Greek-life seniors.",
    "research": "Athlete neuroscience/physiology research (10/2018-05/2019) - 200 hours, TBI research (09/2016-09/2018) - 300 hours, Blood coagulation summer research with the U.S. Army (05/2017- 08/2017) - 400",
    "hobbies": "Performing magic tricks, exercising, and going to pop punk concerts.",
    "otherActivities": "N/A",
    "reflections": "(1) For interviews, prepare a list of stories you know well that you can adapt to whatever question they ask you. It can help you to respond quickly if you have 5-7 vignettes that you can employ to talk about leadership, teamwork, overcoming challenges, or other themes. That way, if you don't have a better answer that comes to mind for a specific question, you can fall back on one of these. (2) I found update letters in December with true updates to be useful in getting interviews from places that previously hadn't given me one, but that may vary for each school. (3) Take deep breaths and recognize that it's going to be okay in the end! Regardless of where you go to medical school, or how long it takes you to get there, you can become a caring, thoughtful, competent, and respected physician.",
    "acceptedSchools": ["ACCEPTED: Columbia", "Vanderbilt", "WashU", "Northwestern", "Brown", "Emory", "and USUHS. WAITLISTED: Stanford", "NYU", "Penn", "Dartmouth", "and Mount Sinai."],
    "gapYears": 3
  },
  {
    "id": "applicant-27",
    "matriculationYear": "2023",
    "stateOfResidency": "NY",
    "gender": "Male",
    "race": "Caucasian",
    "major": "Physics major",
    "gpa": 3.6,
    "mcat": 516,
    "mcatBreakdown": null,
    "medicalVolunteering": "60",
    "nonMedicalVolunteering": "150",
    "leadership": "50",
    "nonMedicalEmployment": "300",
    "medicalEmployment": "0",
    "shadowing": "100",
    "awardsHonors": null,
    "research": "200",
    "hobbies": null,
    "otherActivities": null,
    "reflections": "MCAT is the most important thing to get your foot in the door",
    "acceptedSchools": ["RWJMS", "Quinipiac", "SUNY Downstate"],
    "gapYears": 1
  },
  {
    "id": "applicant-28",
    "matriculationYear": "2024",
    "stateOfResidency": "Pennsylvania",
    "gender": "Male",
    "race": "Asian",
    "major": "Neuroscience Major, Chemistry + Healthcare Management Minor",
    "gpa": 4.0,
    "mcat": 526,
    "mcatBreakdown": null,
    "medicalVolunteering": "None - 0",
    "nonMedicalVolunteering": "Tutoring - 160 hours, Charity Volunteering - 200 hours",
    "leadership": "Club Leadership - 270 hours",
    "nonMedicalEmployment": "Clinical Research - 400 hours, Life Sciences Consulting - 500 hours, Tutoring - 100 hours",
    "medicalEmployment": "EMT - 250 hours",
    "shadowing": "Shadowed 4 physicians for 50 hours total",
    "awardsHonors": "1 co-author publication at the time of application",
    "research": "Global Oncology Research - 600 hours, Pediatric Orthopedics Research - 120 hours, Orthopedic Research - 100 hours",
    "hobbies": "Powerlifting (800 hours)",
    "otherActivities": null,
    "reflections": "I think that having a cohesive narrative is the most important factor of an applicaiton.",
    "acceptedSchools": ["Mayo Clinic", "UVA", "Perelman", "UMiami"],
    "gapYears": 0
  },
  {
    "id": "applicant-29",
    "matriculationYear": "Wayne State University School Of Medicine",
    "stateOfResidency": "New York",
    "gender": "Male",
    "race": "Egyptian",
    "major": "Exercise Physiology major, Community Health Minor",
    "gpa": 3.85,
    "mcat": 507,
    "mcatBreakdown": null,
    "medicalVolunteering": "0 hrs",
    "nonMedicalVolunteering": "Club Community Service Coordinator 250 hrs, Exercise Is Medicine Club Volunteer 250 hrs",
    "leadership": "Vice President of Exercise Is Medicine 300 hours",
    "nonMedicalEmployment": "1st Teaching Assistant of Introduction to Clinical Research And Methodology @ University Affiliated Hospital 200 hrs, Human Anatomy I & II Tutor 100 hrs",
    "medicalEmployment": "Lead Medical Assistant at PM&R Clinic 1,500 hrs, Lead Medical Record Recorder at PM&R clinic 500 hrs",
    "shadowing": "Emergency Room Shadow 500 hours, Orthopedic Surgery Shadow 1,000 hours, Orthopedic Spine Surgery Shadow 600 hrs",
    "awardsHonors": "Provost Scholars Scholarship(4yrs), Deans List(4yrs), Provost Scholars List(2yrs), American College of Sports Medicine(ACSM) Regional Quiz Bowl Champions(Spring'24), Top 10 ACSM National Quiz Bowl Winners(Spring'24), 10 publications total(abstracts, manuscripts), 4 poster presentations at ACSM Ny Conference's( Fall'23 - Spring'24)",
    "research": "Orthopedic Spine Surgery Research Fellow 1,450 hrs, Emergency Medicine Visiting Scholar 300 hrs, Exercise Science Research Assistant 200 hrs, Introduction To Clinical Research Methodology Student Intern 150 hrs, Human Centered Healthcare and Design Innovation Intern 100 hrs",
    "hobbies": "Basketball 10,000 hours",
    "otherActivities": null,
    "reflections": "Honestly, I'm not one to sugarcoat it, this process is very intimidating and scary for most of us. If you're nervous and stressed it's because you care. I want you to remember you're not alone, and we all experience the same stress in some form. With that being said, if you just work hard, be kind to others, never say no, and have an application that aligns with your story, you're going to be okay. The notion \"check off boxes\" is mostly untrue, it only really helps and applies if it makes sense with you and your path into medicine. Be confident, Be human, and take care of yourself. Remember it's a marathon not a sprint, don't sprint quickly and burn out, getting into med school is just the beginning, so please take great care of yourself as you go along. Your personal statement is so so important, the more personal to you the better. Make sure they know 100% you're going to become a physician, not just because you \"like science\", but because you want to use the science of the body to alleviate the suffering of others, to help someone's brother, mother, father, etc. Be empathetic, it goes a long way!!!! You got this!!!",
    "acceptedSchools": ["Wayne State School of Medicine", "MCW", "NSUMD", "NYITCOM", "TOUROCOM", "LECOM"],
    "gapYears": 1
  },
  {
    "id": "applicant-30",
    "matriculationYear": "2024",
    "stateOfResidency": "Michigan",
    "gender": "Male",
    "race": "Hawaiian, Asian, Caucasian",
    "major": "Biology",
    "gpa": 3.75,
    "mcat": 518,
    "mcatBreakdown": null,
    "medicalVolunteering": "0",
    "nonMedicalVolunteering": "Research at Kellogg Eye Center and Chapman Lab at the University of Michigan: 400 hours",
    "leadership": "Vice President and Treasurer of Phi Gamma Delta fraternity",
    "nonMedicalEmployment": "University Employed Tutor of Biochemistry, Biology, General Chemistry, and Organic Chemistry: 400 hours",
    "medicalEmployment": "0",
    "shadowing": "0",
    "awardsHonors": "0",
    "research": "Research at Kellogg Eye Center and Chapman Lab at the University of Michigan: 400 hours",
    "hobbies": null,
    "otherActivities": null,
    "reflections": "Be as punctual as possible, it is absolutely imperative to prepare for every outcome and submit everything the day it opens from primary applications, secondaries, and test scores. Punctuality and organization goes an incredibly long way in the application processes and beyond. Read up on past secondary questions and interview questions for each primary you submit.",
    "acceptedSchools": ["Wayne State School of Medicine and Oakland School of Medicine"],
    "gapYears": 0
  },
  {
    "id": "applicant-31",
    "matriculationYear": "2022",
    "stateOfResidency": "Texas",
    "gender": "Female",
    "race": "Black",
    "major": "Biology major, minor in American Sign Language",
    "gpa": 3.5,
    "mcat": 504,
    "mcatBreakdown": null,
    "medicalVolunteering": "None",
    "nonMedicalVolunteering": "School organization events ~2-4 hours/week for 3 years",
    "leadership": "School organization leadership ~2-4 hours/week for 3 years",
    "nonMedicalEmployment": "Retail worker ~20hr/week for 2 years",
    "medicalEmployment": "Family medicine scribe 40hr/week for 8 months",
    "shadowing": "Shadowing ~10-12 hours",
    "awardsHonors": "Semester honors 1 semester",
    "research": "None",
    "hobbies": "Volleyball, piano, knitting and crocheting",
    "otherActivities": "None",
    "reflections": "Keep working hard, it will all work out in the end. Even with mediocre scores and all, just keep trying.",
    "acceptedSchools": ["Wayne state"],
    "gapYears": 1
  }
]